I'm facing this issue when creating a bot user using the Terraform provider. I'm using provider 15.0.1 and cluster 15.0.1

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # teleport_bot.teleport_machine_id will be created
  + resource "teleport_bot" "teleport_machine_id" {
      + id        = (known after apply)
      + name      = "teleport-machine-id"
      + role_name = (known after apply)
      + roles     = [
          + "teleport-machine-id",
        ]
      + token_id  = (sensitive value)
      + token_ttl = (known after apply)
      + user_name = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

```
╷
│ Error: Error creating Bot
│ 
│   with teleport_bot.teleport_machine_id,
│   on teleport_machine_id.tf line 48, in resource "teleport_bot" "teleport_machine_id":
│   48: resource "teleport_bot" "teleport_machine_id" {
│ 
│ Terraform user has no rights to perform this action. Check that Terraform
│ user role has ['list','create','read','update','delete'] verbs for 'bot'
│ resource.
│       token with name "1707918339097787155" not found, create the token or do
│ not set TokenName: provisioning token(**************87155) not found
╵
```

But I can see all the resources:
```
→ tctl bots ls
Bot                 User                    Roles                   
------------------- ----------------------- ----------------------- 
teleport-machine-id bot-teleport-machine-id bot-teleport-machine-id 

→ tctl users ls                       
User                                Roles                                                          
----------------------------------- --------------------------------------------------------------                                                 
bot-teleport-machine-id             bot-teleport-machine-id   

→ tctl get role/bot-teleport-machine-id   
kind: role
metadata:
  description: Automatically generated role for bot teleport-machine-id
  id: 1707918628738466431
  labels:
    teleport.internal/bot: teleport-machine-id
  name: bot-teleport-machine-id
  revision: 65a90139-ff78-4200-9bd2-96f708f208ae
```